app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "year", "description", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sadsad"], ["year", "2017-12-10 17:04:00"], ["description", "sdas"], ["genre", "ds"], ["created_at", "2017-12-10 17:04:33.978140"], ["updated_at", "2017-12-10 17:04:33.978140"]]