app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "user"], ["updated_at", "2017-12-10 15:57:44.504026"], ["id", 23]]